Config/Catalogs/ОперандыПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОперандыПоказателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КонтрольныеСоотношения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияОперандов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапросаМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьПромежуточныеИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОперандаРасчет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаИспользованияПолейЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаОперанда</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СопоставляемаяАналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДевятьМесяцев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ОперандыПоказателей/Forms/РедактированиеСпискаЗначенийОтбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпЗначение             = Параметры.Значение;
	СпЗначение.ТипЗначения = Параметры.ТипЗначения;
	
	Если СпЗначение.ТипЗначения.СодержитТип(Тип("ПеречислениеСсылка.Периодичность")) Тогда
		//неделя не поддерживается
		СпЗначение.ДоступныеЗначения = Новый СписокЗначений;
		СпЗначение.ДоступныеЗначения.Добавить(Перечисления.Периодичность.Год);
		СпЗначение.ДоступныеЗначения.Добавить(Перечисления.Периодичность.ДевятьМесяцев);
		СпЗначение.ДоступныеЗначения.Добавить(Перечисления.Периодичность.Полугодие);
		СпЗначение.ДоступныеЗначения.Добавить(Перечисления.Периодичность.Квартал);
		СпЗначение.ДоступныеЗначения.Добавить(Перечисления.Периодичность.Месяц);
		СпЗначение.ДоступныеЗначения.Добавить(Перечисления.Периодичность.Декада);
		СпЗначение.ДоступныеЗначения.Добавить(Перечисления.Периодичность.День);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ИмяФормыВыбораБК) Тогда
		Элементы.ЗначениеЗначение.КнопкаВыбора = Истина;
		Элементы.ЗначениеПодбор.Видимость = Ложь;//для строковых типов не показываем стандартную кнопку подбора
	КонецЕсли;
	
	Элементы.ЗначениеПодобрать.Видимость = ЗначениеЗаполнено(Параметры.ИмяФормыВыбораБК);
	
	Если ТипЗнч(Параметры.ПараметрыВыбораЗначения) = Тип("Массив") Тогда
		Элементы.ЗначениеЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(Параметры.ПараметрыВыбораЗначения);
	ИначеЕсли ТипЗнч(Параметры.ПараметрыВыбораЗначения) = Тип("ФиксированныйМассив") Тогда
		Элементы.ЗначениеЗначение.ПараметрыВыбора = Параметры.ПараметрыВыбораЗначения;
	КонецЕсли;
	
	Элементы.Значение.ТолькоПросмотр = ЭтотОбъект.ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(Параметры.ИмяФормыВыбораБК) Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			Для Каждого ЭлМас Из ВыбранноеЗначение Цикл
				ТекЗначение = СокрЛП(ЭлМас);
				Если СпЗначение.НайтиПоЗначению(ТекЗначение) = Неопределено Тогда
					СпЗначение.Добавить(ТекЗначение);
				КонецЕсли;	
			КонецЦикла;
		Иначе
			ТекЗначение = СокрЛП(ВыбранноеЗначение);
			Если СпЗначение.НайтиПоЗначению(ТекЗначение) = Неопределено Тогда
				СпЗначение.Добавить(ТекЗначение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСпЗначение

&НаКлиенте
Процедура ЗначениеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ИмяФормыВыбораБК) Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЗначенияБК", ЭтаФорма);
		
		ОткрытьФорму(Параметры.ИмяФормыВыбораБК, ПараметрыФормы, ЭтаФорма, , , ,ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыборе(СпЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	Если ЗначениеЗаполнено(Параметры.ИмяФормыВыбораБК) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
		
		ОткрытьФорму(Параметры.ИмяФормыВыбораБК, ПараметрыФормы, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораЗначенияБК(Результат, ДополнительныеПараметры)Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = СокрЛП(Результат);
	Если СпЗначение.НайтиПоЗначению(Результат) = Неопределено Тогда
		ТекСтр = СпЗначение.НайтиПоИдентификатору(Элементы.Значение.ТекущаяСтрока);
		ТекСтр.Значение = СокрЛП(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
